[
  {
    "text": "Olá, meu nome é Denis Rodrigues, sou um desenvolvedor front-end e mobile com habilidades em HTML, CSS, avascript, React.js, React Native, Bootstrap 5 e muito mais. Atualmente estou cursando o último ano da faculdade de análise e Desenvolvimento de Sistemas, além de ter estagiado em uma empresa de tecnologia, o que me proporcionou     experiência prática na área.",
    "ilustracao": "public/assets/sobre/ilustracao1.jpg"
  },
  {
    "text": "Sou apaixonado por desenvolvimento web e mobile, e tenho como objetivo criar interfaces de alta qualidade e experiências intuitivas para os usuários. Busco sempre me manter atualizado sobre as tendências e novidades do mercado, e estou constantemente aprimorando minhas habilidades através da aprendizagem e troca de experiências com profissionais do mercado.",
    "ilustracao": "public/assets/sobre/ilustracao2.jpg"
  },
  {
    "text": "Minhas habilidades em resolução de problemas, comunicação e colaboração em equipe me permitem trabalhar em projetos complexos e ambientes acelerador. Acredito na importância da colaboração e do compartilhamento de ideias com outros desenvolvedores e colegas de trabalho, para que possamos alcançar os melhores resultados.",
    "ilustracao": "public/assets/sobre/ilustracao3.jpg"
  },
  {
    "text": "Como desenvolvedor, meu compromisso é criar interfaces web e mobile de alta qualidade que sejam intuitivas, funcionais e agradáveis aos usuários. Além disso, possuo habilidades sólidas em resolução de problemas e colaboração em equipe.",
    "ilustracao": "public/assets/sobre/ilustracao4.jpg"
  },
  {
    "text": "Estou sempre buscando expandir minhas habilidades e conhecimentos por meio da aprendizagem contínua e da exploração de novas tecnologias e ferramentas. Também valorizo a colaboração e o compartilhamento de ideias com outros desenvolvedores e colegas de trabalho.",
    "ilustracao": "public/assets/sobre/ilustracao5.jpg"
  },
  {
    "text": "Se você está procurando um desenvolvedor front-end apaixonado e altamente motivado para trabalhar em sua equipe, entre em contato comigo. Será um prazer conversar com você.",
    "ilustracao": "public/assets/sobre/ilustracao6.jpg"
  }
]
